Ansible/Auto Hardware RMA/tasks/templates/dell_rma.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://api.dell.com">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CreateDispatch>
         <tem:CreateDispatchRequest>
            <tem:Login>{{ login_email }}</tem:Login>
            <tem:Password>{{ login_password }}</tem:Password>
            <tem:Dispatch>
               <tem:TechEmail>{{ engineers_email }}</tem:TechEmail>
               <tem:Branch>{{ branch }}</tem:Branch>
               <tem:Customer>{{ company }}</tem:Customer>
               <tem:Track>Tier 1</tem:Track>
               <tem:ServiceTag>{{ database_return['item'][serialtag].name }}</tem:ServiceTag>
               <tem:PrimaryContactName>{{ get.jira_engineers_webname }}</tem:PrimaryContactName>
               <tem:PrimaryContactPhone>{{ dummy_number}}</tem:PrimaryContactPhone>
               <tem:PrimaryContactEmail>{{ get.jira_engineers_email }}</tem:PrimaryContactEmail>
               <tem:ShipToAddress>
                  <tem:AddressBookName/>
                  <tem:CountryISOCode>{{ country }}</tem:CountryISOCode>
                  <tem:City>{{ city }}</tem:City>
                  <tem:State>{{ state }}</tem:State>
                  <tem:ZipPostalCode>{{ postal_code }}</tem:ZipPostalCode>
                  <tem:AddressLine1>{{ address.split(',')[0] | string }}</tem:AddressLine1>
                  <tem:AddressLine2>{{ address.split(',')[1] | string }}</tem:AddressLine2>
                  <tem:AddressLine3>{{ address.split(',')[2] | string }}</tem:AddressLine3>
                  <tem:TimeZone>{{ current_timezone }}</tem:TimeZone>
               </tem:ShipToAddress>
               <tem:RequestCompleteCare>false</tem:RequestCompleteCare>
               <tem:RequestReturnToDepot>false</tem:RequestReturnToDepot>
               <tem:RequestOnSiteTechnician>false</tem:RequestOnSiteTechnician>
               <tem:ReferencePONumber/>
               <tem:ProblemDescription>#({{ get.jira_ticket_number }}) | {{ get.broken_part }}</tem:ProblemDescription>
               <tem:TroubleshootingNote>{{ boilerplate_text  }}</tem:TroubleshootingNote>
               <tem:OverrideDPSType/>
               <tem:Parts>
                  <tem:PartInfo>
                     <tem:PartNumber>{{ broken_part_number }}</tem:PartNumber>
                     <tem:PPID/>
                     <tem:Quantity>{{ amount }}</tem:Quantity>
                  </tem:PartInfo>
               </tem:Parts>
               <tem:Attachments/>
            </tem:Dispatch>
         </tem:CreateDispatchRequest>
         <tem:CreateDispatch/>
      </tem:CreateDispatch>
   </soapenv:Body>
</soapenv:Envelope>
